app/Controllers/Admin.php

    public function users()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`