app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'valdez@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $users   = new UserModel();

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $users->where('email', $email)->first();

SELECT *
FROM `announcements`
ORDER BY `date_posted` DESC
---
    public function dashboard()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'You must log in first.');
        }

        // ✅ Load announcements from the database
        $announcementModel = new AnnouncementModel();
        $announcements = $announcementModel->orderBy('date_posted', 'DESC')->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '14'
---
    public function manageUsers()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/dashboard')->with('error', 'Access denied.');
        }

        $userModel = new UserModel();
        $currentUserId = session()->get('id');

        $users = $userModel->where('id !=', $currentUserId)->findAll();